ilovezfs/gputils/gputils/header/p18f64j15.inc
;==========================================================================
;
;       RAM Definitions
;
;==========================================================================
       __MAXRAM  H'0FFF'
       __BADRAM  H'0800'-H'0F5F'
       __BADRAM  H'0F7A'-H'0F7B'
       __BADRAM  H'0F87'-H'0F88'
       __BADRAM  H'0F90'-H'0F91'
       __BADRAM  H'0F99'-H'0F9A'
       __BADRAM  H'0FA6'-H'0FAA'
       __BADRAM  H'0FD2'
       __BADRAM  H'0FD4'

;==========================================================================
;
;   IMPORTANT: For the PIC18 devices, the __CONFIG directive has been
;              superseded by the CONFIG directive.  The following settings
;              are available for this device.
;
;   Background Debugger Enable:
;     DEBUG = ON           Enabled
;     DEBUG = OFF          Disabled
;
;   Extended Instruction Set Enable:
;     XINST = OFF          Disabled
;     XINST = ON           Enabled
;
;   Stack Overflow Reset:
;     STVR = OFF           Disabled
;     STVR = ON            Enabled
;
;   Low Voltage ICSP:
;     LVP = OFF            Disabled
;     LVP = ON             Enabled
;
;   Watchdog Timer:
;     WDT = OFF            Disabled
;     WDT = ON             Enabled
;
;   Configuration Word Signature:
;     SIGN = CLR           Clear
;     SIGN = SET           Set
;
;   Code Protection:
;     CP0 = ON             Enabled
;     CP0 = OFF            Disabled
;
;   Fail Safe Clock Monitor:
;     FCMEM = OFF          Disabled
;     FCMEM = ON           Enabled
;
;   Internal/External Switch Over:
;     IESO = OFF           Disabled
;     IESO = ON            Enabled
;
;   Oscillator Selection bits:
;     FOSC = HS            HS oscillator
;     FOSC = HSPLL         HS oscillator, Software Controlled PLL
;     FOSC = EC            External Clock
;     FOSC = ECPLL         External Clock, Software Controlled PLL
;
;   Watchdog Postscaler:
;     WDTPS = 1            1:1
;     WDTPS = 2            1:2
;     WDTPS = 4            1:4
;     WDTPS = 8            1:8
;     WDTPS = 16           1:16
;     WDTPS = 32           1:32
;     WDTPS = 64           1:64
;     WDTPS = 128          1:128
;     WDTPS = 256          1:256
;     WDTPS = 512          1:512
;     WDTPS = 1024         1:1024
;     WDTPS = 2048         1:2048
;     WDTPS = 4096         1:4096
;     WDTPS = 8192         1:8192
;     WDTPS = 16384        1:16384
;     WDTPS = 32768        1:32768
;
;   External Bus Data Wait:
;     WAIT = ON            Enabled
;     WAIT = OFF           Disabled
;
;   Data Bus Width Select:
;     BW = 8               8-bit external bus
;     BW = 16              16-bit external bus
;
;   Processor Mode Selection:
;     MODE = MM            Microcontroller Mode - External bus disabled
;     MODE = XM12          Extended Microcontroller Mode - 12-bit address mode
;     MODE = XM16          Extended Microcontroller Mode - 16-bit address mode
;     MODE = XM20          Extended Microcontroller Mode - 20-bit address mode
;
;   External Address Bus Shift Enable:
;     EASHIFT = OFF        External bus reflects PC value
;     EASHIFT = ON         External bus starts at 000000h
;
;   CCP2 Mux:
;     CCP2MUX = OFF        Disabled
;     CCP2MUX = ON         Enabled
;
;==========================================================================
;==========================================================================
;
;       Configuration Bits
;
;   NAME            Address
;   CONFIG1L        300000h
;   CONFIG1H        300001h
;   CONFIG2L        300002h
;   CONFIG2H        300003h
;   CONFIG3L        300004h
;   CONFIG3H        300005h
;
;==========================================================================

; The following is an assignment of address values for all of the
; configuration registers for the purpose of table reads
_CONFIG1L        EQU  H'300000'
_CONFIG1H        EQU  H'300001'
_CONFIG2L        EQU  H'300002'
_CONFIG2H        EQU  H'300003'
_CONFIG3L        EQU  H'300004'
_CONFIG3H        EQU  H'300005'

;----- CONFIG1L Options --------------------------------------------------
_DEBUG_ON_1L         EQU  H'7F'    ; Enabled
_DEBUG_OFF_1L        EQU  H'FF'    ; Disabled

_XINST_OFF_1L        EQU  H'BF'    ; Disabled
_XINST_ON_1L         EQU  H'FF'    ; Enabled

_STVR_OFF_1L         EQU  H'DF'    ; Disabled
_STVR_ON_1L          EQU  H'FF'    ; Enabled

_LVP_OFF_1L          EQU  H'EF'    ; Disabled
_LVP_ON_1L           EQU  H'FF'    ; Enabled

_WDT_OFF_1L          EQU  H'FE'    ; Disabled
_WDT_ON_1L           EQU  H'FF'    ; Enabled

;----- CONFIG1H Options --------------------------------------------------
_SIGN_CLR_1H         EQU  H'F7'    ; Clear
_SIGN_SET_1H         EQU  H'FF'    ; Set

_CP0_ON_1H           EQU  H'FB'    ; Enabled
_CP0_OFF_1H          EQU  H'FF'    ; Disabled

;----- CONFIG2L Options --------------------------------------------------
_FCMEM_OFF_2L        EQU  H'BF'    ; Disabled
_FCMEM_ON_2L         EQU  H'FF'    ; Enabled

_IESO_OFF_2L         EQU  H'7F'    ; Disabled
_IESO_ON_2L          EQU  H'FF'    ; Enabled

_FOSC_HS_2L          EQU  H'FC'    ; HS oscillator
_FOSC_HSPLL_2L       EQU  H'FD'    ; HS oscillator, Software Controlled PLL
_FOSC_EC_2L          EQU  H'FE'    ; External Clock
_FOSC_ECPLL_2L       EQU  H'FF'    ; External Clock, Software Controlled PLL

;----- CONFIG2H Options --------------------------------------------------
_WDTPS_1_2H          EQU  H'E1'    ; 1:1
_WDTPS_2_2H          EQU  H'E3'    ; 1:2
_WDTPS_4_2H          EQU  H'E5'    ; 1:4
_WDTPS_8_2H          EQU  H'E7'    ; 1:8
_WDTPS_16_2H         EQU  H'E9'    ; 1:16
_WDTPS_32_2H         EQU  H'EB'    ; 1:32
_WDTPS_64_2H         EQU  H'ED'    ; 1:64
_WDTPS_128_2H        EQU  H'EF'    ; 1:128
_WDTPS_256_2H        EQU  H'F1'    ; 1:256
_WDTPS_512_2H        EQU  H'F3'    ; 1:512
_WDTPS_1024_2H       EQU  H'F5'    ; 1:1024
_WDTPS_2048_2H       EQU  H'F7'    ; 1:2048
_WDTPS_4096_2H       EQU  H'F9'    ; 1:4096
_WDTPS_8192_2H       EQU  H'FB'    ; 1:8192
_WDTPS_16384_2H      EQU  H'FD'    ; 1:16384
_WDTPS_32768_2H      EQU  H'FF'    ; 1:32768

;----- CONFIG3L Options --------------------------------------------------
_WAIT_ON_3L          EQU  H'7F'    ; Enabled
_WAIT_OFF_3L         EQU  H'FF'    ; Disabled

_BW_8_3L             EQU  H'BF'    ; 8-bit external bus
_BW_16_3L            EQU  H'FF'    ; 16-bit external bus

_MODE_MM_3L          EQU  H'CF'    ; Microcontroller Mode - External bus disabled
_MODE_XM12_3L        EQU  H'DF'    ; Extended Microcontroller Mode - 12-bit address mode
_MODE_XM16_3L        EQU  H'EF'    ; Extended Microcontroller Mode - 16-bit address mode
_MODE_XM20_3L        EQU  H'FF'    ; Extended Microcontroller Mode - 20-bit address mode

_EASHIFT_OFF_3L      EQU  H'F7'    ; External bus reflects PC value
_EASHIFT_ON_3L       EQU  H'FF'    ; External bus starts at 000000h

;----- CONFIG3H Options --------------------------------------------------
_CCP2MUX_OFF_3H      EQU  H'FE'    ; Disabled
_CCP2MUX_ON_3H       EQU  H'FF'    ; Enabled


_DEVID1          EQU  H'3FFFFE'
_DEVID2          EQU  H'3FFFFF'


        LIST
